events = [
    # Історія
    {    "question": "У якому році відбулася подія: Прийняття Конституції України?",
    "options": ["1996", "1991", "2004", "1986"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Чорнобильська катастрофа?",
    "options": ["1986", "1991", "1979", "2000"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Акт проголошення незалежності України?",
    "options": ["1991", "1996", "1986", "2004"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Битва під Крутами?",
    "options": ["1918", "1921", "1932", "1919"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Голодомор в Україні?",
    "options": ["1932", "1941", "1929", "1937"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Революції Гідності?",
    "options": ["2013", "2014", "2004", "2010"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок російсько-української війни?",
    "options": ["2014", "2013", "2022", "2008"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Переяславська рада?",
    "options": ["1654", "1648", "1709", "1667"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Злука УНР і ЗУНР (Акт Злуки)?",
    "options": ["1919", "1918", "1921", "1939"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Коронація Данила Галицького?",
    "options": ["1253", "1240", "1238", "1264"],
    "correct_option_id": 0
},

    # Відомі українці
    {        "question": "Хто є автором поеми 'Катерина'?",
        "options": ["Тарас Шевченко", "Іван Франко", "Леся Українка", "Павло Тичина"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений відкрив вакцину проти чуми?",
        "options": ["Володимир Хавкін", "Ілля Мечников", "Борис Патон", "Сергій Корольов"],
        "correct_option_id": 0
    },
    {        "question": "Хто створив першу українську конституцію?",
        "options": ["Пилип Орлик", "Богдан Хмельницький", "Іван Мазепа", "Данило Галицький"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська письменниця відома під псевдонімом Леся Українка?",
        "options": ["Лариса Косач", "Ольга Кобилянська", "Марко Вовчок", "Ліна Костенко"],
        "correct_option_id": 0
    },

    # Географія
    {        "question": "Яка найбільша річка України?",
        "options": ["Дніпро", "Дністер", "Південний Буг", "Сіверський Донець"],
        "correct_option_id": 0
    },
    {        "question": "Яка найвища гора України?",
        "options": ["Говерла", "Петрос", "Піп Іван", "Бребенескул"],
        "correct_option_id": 0
    },
    {        "question": "Яке місто є столицею України?",
        "options": ["Київ", "Львів", "Харків", "Одеса"],
        "correct_option_id": 0
    },
    
    # Історія
    {    "question": "У якому році відбулася подія: Початок визвольної війни під проводом Богдана Хмельницького?",
    "options": ["1648", "1654", "1709", "1667"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Підписання Брест-Литовського миру?",
    "options": ["1918", "1919", "1921", "1939"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Відкриття Києво-Могилянської академії?",
    "options": ["1632", "1661", "1576", "1708"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Помаранчевої революції?",
    "options": ["2004", "2013", "2010", "2014"],
    "correct_option_id": 0
},
    {    "question": "У якому році відбулася подія: Операція «Вісла»?",
    "options": ["1947", "1945", "1939", "1941"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Другої світової війни на території України?",
    "options": ["1941", "1939", "1945", "1947"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок НЕПу в Україні?",
    "options": ["1921", "1923", "1928", "1929"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Карпатської України?",
    "options": ["1939", "1941", "1945", "1947"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Великого терору?",
    "options": ["1937", "1932", "1929", "1941"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Підписання Будапештського меморандуму?",
    "options": ["1994", "1991", "1996", "2004"],
    "correct_option_id": 0
},

    # Відомі українці
    {        "question": "Хто є автором роману 'Тигролови'?",
        "options": ["Іван Багряний", "Олесь Гончар", "Павло Загребельний", "Василь Шкляр"],
        "correct_option_id": 0
    },
    {        "question": "Який український композитор написав оперу 'Запорожець за Дунаєм'?",
        "options": ["Семен Гулак-Артемовський", "Микола Лисенко", "Кирило Стеценко", "Михайло Вербицький"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська поетеса написала 'Лісову пісню'?",
        "options": ["Леся Українка", "Ліна Костенко", "Ольга Кобилянська", "Марко Вовчок"],
        "correct_option_id": 0
    },
    {        "question": "Який український режисер отримав 'Золоту пальмову гілку' у Каннах?",
        "options": ["Сергій Лозниця", "Кіра Муратова", "Михайло Іллєнко", "Олег Сенцов"],
        "correct_option_id": 0
    },

    # Географія
    {        "question": "Яке місто є найзахіднішим обласним центром України?",
        "options": ["Ужгород", "Львів", "Івано-Франківськ", "Чернівці"],
        "correct_option_id": 0
    },
    {        "question": "Яка річка є найдовшою притокою Дніпра?",
        "options": ["Десна", "Прип'ять", "Псел", "Інгулець"],
        "correct_option_id": 0
    },
    {        "question": "Який півострів є найбільшим в Україні?",
        "options": ["Кримський", "Кінбурнський", "Тарханкутський", "Арабатська стрілка"],
        "correct_option_id": 0
    },
    # Історія
    {    "question": "У якому році відбулася подія: Заснування Львівського університету?",
    "options": ["1661", "1784", "1804", "1873"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Козацької доби?",
    "options": ["1492", "1648", "1667", "1708"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Скасування кріпацтва в Україні?",
    "options": ["1861", "1853", "1804", "1784"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Руїни?",
    "options": ["1657", "1648", "1667", "1708"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Підписання Андрусівського миру?",
    "options": ["1667", "1654", "1648", "1708"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Заснування Харківського університету?",
    "options": ["1804", "1784", "1661", "1873"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Відкриття першої залізниці у Львові?",
    "options": ["1861", "1853", "1804", "1784"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок радянської індустріалізації в Україні?",
    "options": ["1928", "1923", "1929", "1932"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок політики українізації?",
    "options": ["1923", "1928", "1929", "1932"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок колективізації в Україні?",
    "options": ["1929", "1923", "1928", "1932"],
    "correct_option_id": 0
},

    # Відомі українці
    {        "question": "Хто написав роман 'Собор'?",
        "options": ["Олесь Гончар", "Іван Франко", "Павло Загребельний", "Василь Шкляр"],
        "correct_option_id": 0
    },
    {        "question": "Який український актор зіграв Тараса Бульбу у фільмі 2009 року?",
        "options": ["Богдан Ступка", "Богдан Бенюк", "Олексій Горбунов", "Володимир Горянський"],
        "correct_option_id": 0
    },
    {        "question": "Який український художник створив серію картин 'Козак Мамай'?",
        "options": ["Невідомий народний майстер", "Іван Марчук", "Тарас Шевченко", "Олександр Мурашко"],
        "correct_option_id": 0
    },
    {        "question": "Хто є автором музики до гімну України?",
        "options": ["Михайло Вербицький", "Павло Чубинський", "Микола Лисенко", "Кирило Стеценко"],
        "correct_option_id": 0
    },

    # Географія
    {        "question": "Який заповідник є найбільшим в Україні?",
        "options": ["Асканія-Нова", "Карпатський", "Шацький", "Дунайський"],
        "correct_option_id": 0
    },
    {        "question": "Яке місто розташоване на двох континентах?",
        "options": ["Маріуполь", "Запоріжжя", "Одеса", "Жодне з цих"],
        "correct_option_id": 3
    },
    {        "question": "Яка річка впадає у Чорне море біля Одеси?",
        "options": ["Дністер", "Дніпро", "Південний Буг", "Дунай"],
        "correct_option_id": 0
    },
    {        "question": "Який острів є найбільшим в Україні?",
        "options": ["Джарилгач", "Зміїний", "Тендрівська коса", "Хортиця"],
        "correct_option_id": 0
    },
    # Історія
    {    "question": "У якому році відбулася подія: Початок визвольної боротьби УПА?",
    "options": ["1942", "1939", "1941", "1945"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Відкриття першої української гімназії у Львові?",
    "options": ["1784", "1661", "1804", "1873"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок відлиги в Україні?",
    "options": ["1953", "1960", "1947", "1985"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок дисидентського руху?",
    "options": ["1960", "1953", "1985", "1990"],
    "correct_option_id": 0
},
    {    "question": "У якому році відбулася подія: Відкриття першої сесії Верховної Ради незалежної України?",
    "options": ["1990", "1991", "1994", "1996"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок незалежності Карпатської України?",
    "options": ["1939", "1941", "1945", "1947"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок масових репресій в Україні?",
    "options": ["1937", "1932", "1929", "1941"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок перебудови (перестройки) в Україні?",
    "options": ["1985", "1960", "1953", "1990"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок радянської окупації Західної України?",
    "options": ["1939", "1941", "1945", "1947"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Заснування Наукового товариства імені Шевченка?",
    "options": ["1873", "1784", "1804", "1661"],
    "correct_option_id": 0
},

    # Відомі українці
    {        "question": "Який український письменник написав 'Захар Беркут'?",
        "options": ["Іван Франко", "Панас Мирний", "Пантелеймон Куліш", "Олесь Гончар"],
        "correct_option_id": 0
    },
    {        "question": "Хто є автором поеми 'Мойсей'?",
        "options": ["Іван Франко", "Тарас Шевченко", "Леся Українка", "Павло Тичина"],
        "correct_option_id": 0
    },
    {        "question": "Який український композитор написав оперу 'Наталка Полтавка'?",
        "options": ["Микола Лисенко", "Семен Гулак-Артемовський", "Кирило Стеценко", "Михайло Вербицький"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська поетеса написала 'Маруся Чурай'?",
        "options": ["Ліна Костенко", "Леся Українка", "Ольга Кобилянська", "Марко Вовчок"],
        "correct_option_id": 0
    },

    # Географія
    {        "question": "Яке місто є найпівнічнішим обласним центром України?",
        "options": ["Чернігів", "Суми", "Житомир", "Київ"],
        "correct_option_id": 0
    },
    {        "question": "Яка річка є найбільшою притокою Дністра?",
        "options": ["Збруч", "Стрий", "Прут", "Смотрич"],
        "correct_option_id": 0
    },
    {        "question": "Який півострів розташований на півдні України?",
        "options": ["Кримський", "Кінбурнський", "Тарханкутський", "Арабатська стрілка"],
        "correct_option_id": 0
    },
    # Історія
    {    "question": "У якому році відбулася подія: Початок Української революції?",
    "options": ["1917", "1918", "1921", "1939"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Вступ України до ООН?",
    "options": ["1945", "1947", "1939", "1991"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Заснування Києва?",
    "options": ["482", "988", "1240", "1015"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Кримської війни?",
    "options": ["1853", "1861", "1914", "1804"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Першої світової війни?",
    "options": ["1914", "1917", "1939", "1921"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Коліївщини?",
    "options": ["1768", "1708", "1648", "1784"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Гетьманщини?",
    "options": ["1648", "1654", "1709", "1667"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок визвольної війни під проводом Івана Мазепи?",
    "options": ["1708", "1648", "1768", "1667"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Другої світової війни?",
    "options": ["1939", "1941", "1945", "1929"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Повномасштабне вторгнення РФ в Україну?",
    "options": ["2022", "2014", "2017", "2008"],
    "correct_option_id": 0
},

    # Відомі українці
    {        "question": "Хто є автором роману 'Вершники'?",
        "options": ["Юрій Яновський", "Олесь Гончар", "Іван Франко", "Павло Загребельний"],
        "correct_option_id": 0
    },
    {        "question": "Який український композитор написав оперу 'Тарас Бульба'?",
        "options": ["Микола Лисенко", "Семен Гулак-Артемовський", "Кирило Стеценко", "Михайло Вербицький"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська поетеса написала 'Contra spem spero!'?",
        "options": ["Леся Українка", "Ліна Костенко", "Ольга Кобилянська", "Марко Вовчок"],
        "correct_option_id": 0
    },
    {        "question": "Який український режисер отримав премію 'Срібний ведмідь' у Берліні?",
        "options": ["Сергій Лозниця", "Кіра Муратова", "Михайло Іллєнко", "Олег Сенцов"],
        "correct_option_id": 0
    },

    # Географія
    {        "question": "Яке місто є найпівденнішим в Україні?",
        "options": ["Форос", "Одеса", "Ялта", "Севастополь"],
        "correct_option_id": 0
    },
    {        "question": "Яка річка є найбільшою притокою Південного Бугу?",
        "options": ["Інгул", "Синюха", "Вовк", "Рось"],
        "correct_option_id": 1
    },
    {        "question": "Який острів є найзахіднішим в Україні?",
        "options": ["Маяк", "Джарилгач", "Зміїний", "Тендрівська коса"],
        "correct_option_id": 2
    },
    {        "question": "Яке місто називають 'столицею Поділля'?",
        "options": ["Вінниця", "Хмельницький", "Кам'янець-Подільський", "Житомир"],
        "correct_option_id": 0
    },
    # Історія
    {    "question": "У якому році відбулася подія: Початок Запорозької Січі?",
    "options": ["1556", "1648", "1492", "1576"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Руїни в Україні?",
    "options": ["1657", "1648", "1667", "1709"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Заснування Острозької академії?",
    "options": ["1576", "1661", "1632", "1804"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок визвольної війни під проводом Северина Наливайка?",
    "options": ["1594", "1648", "1625", "1637"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Литовсько-руської держави?",
    "options": ["1385", "1240", "1492", "1430"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Куруківської угоди?",
    "options": ["1625", "1654", "1632", "1667"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Національно-визвольної війни ОУН-УПА?",
    "options": ["1942", "1939", "1941", "1945"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок відновлення незалежності України?",
    "options": ["1991", "1996", "1986", "2004"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок реформи децентралізації в Україні?",
    "options": ["2015", "2014", "2017", "2013"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок першої хвилі еміграції з України?",
    "options": ["1870", "1784", "1861", "1917"],
    "correct_option_id": 0
},

    # Відомі українці
    {        "question": "Хто є автором роману 'Тигролови'?",
        "options": ["Іван Багряний", "Олесь Гончар", "Павло Загребельний", "Василь Шкляр"],
        "correct_option_id": 0
    },
    {        "question": "Який український композитор написав оперу 'Запорожець за Дунаєм'?",
        "options": ["Семен Гулак-Артемовський", "Микола Лисенко", "Кирило Стеценко", "Михайло Вербицький"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська поетеса написала 'Давидові псалми'?",
        "options": ["Леся Українка", "Ліна Костенко", "Ольга Кобилянська", "Марко Вовчок"],
        "correct_option_id": 0
    },
    {        "question": "Який український режисер отримав премію 'Золота дзиґа'?",
        "options": ["Анатолій Матешко", "Олег Сенцов", "Мирослав Слабошпицький", "Валентин Васянович"],
        "correct_option_id": 3
    },

    # Географія
    {        "question": "Яке місто є найпівнічнішим в Україні?",
        "options": ["Сновськ", "Чернігів", "Шостка", "Конотоп"],
        "correct_option_id": 0
    },
    {        "question": "Яка річка є найдовшою в Україні?",
        "options": ["Дніпро", "Дністер", "Південний Буг", "Сіверський Донець"],
        "correct_option_id": 0
    },
    {        "question": "Який острів є найбільшим у Чорному морі біля України?",
        "options": ["Джарилгач", "Зміїний", "Тендрівська коса", "Березань"],
        "correct_option_id": 0
    },
    # Історія
   {    "question": "У якому році відбулася подія: Початок Козацько-селянських повстань під проводом Павлюка?",
    "options": ["1637", "1594", "1648", "1625"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок повстання під проводом Івана Богуна?",
    "options": ["1651", "1657", "1648", "1709"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Заснування Чорноморського козацького війська?",
    "options": ["1787", "1784", "1804", "1861"],
    "correct_option_id": 0
},
   {    "question": "У якому році відбулася подія: Початок Другої світової війни на території України?",
    "options": ["1941", "1939", "1945", "1947"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Голодомору в Україні?",
    "options": ["1932", "1929", "1937", "1941"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Карпатської України?",
    "options": ["1939", "1942", "1937", "1945"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок Революції Гідності?",
    "options": ["2013", "2014", "2004", "2010"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок анексії Криму Росією?",
    "options": ["2014", "2013", "2015", "2022"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок війни на Донбасі?",
    "options": ["2014", "2013", "2015", "2022"],
    "correct_option_id": 0
},
{    "question": "У якому році відбулася подія: Початок безвізового режиму з ЄС для України?",
    "options": ["2017", "2015", "2014", "2022"],
    "correct_option_id": 0
},

    # Відомі українці
    {        "question": "Хто є автором роману 'Чорна рада'?",
        "options": ["Пантелеймон Куліш", "Іван Франко", "Олесь Гончар", "Павло Загребельний"],
        "correct_option_id": 0
    },
    {        "question": "Який український композитор написав оперу 'Катерина'?",
        "options": ["Микола Аркас", "Микола Лисенко", "Кирило Стеценко", "Михайло Вербицький"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська поетеса написала 'Слово про Ігорів похід'?",
        "options": ["Жодна з них", "Леся Українка", "Ліна Костенко", "Ольга Кобилянська"],
        "correct_option_id": 0
    },
    {        "question": "Який український режисер отримав премію 'Кіноколо'?",
        "options": ["Антоніо Лукіч", "Олег Сенцов", "Мирослав Слабошпицький", "Валентин Васянович"],
        "correct_option_id": 0
    },

    # Географія
    {        "question": "Яке місто є найзахіднішим в Україні?",
        "options": ["Чоп", "Ужгород", "Львів", "Мукачево"],
        "correct_option_id": 0
    },
    {        "question": "Яка річка є найдовшою в межах України?",
        "options": ["Дніпро", "Дністер", "Південний Буг", "Сіверський Донець"],
        "correct_option_id": 0
    },
    {        "question": "Який острів є найсхіднішим в Україні?",
        "options": ["Зміїний", "Джарилгач", "Тендрівська коса", "Березань"],
        "correct_option_id": 0
    },
    # Спорт
    {        "question": "Який український футболіст став найкращим бомбардиром Ліги чемпіонів 1998/99?",
        "options": ["Андрій Шевченко", "Сергій Ребров", "Олег Блохін", "Євген Коноплянка"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська легкоатлетка встановила світовий рекорд зі стрибків у висоту?",
        "options": ["Ярослава Магучіх", "Інеса Кравець", "Олена Говорова", "Лілія Подкопаєва"],
        "correct_option_id": 0
    },
    {        "question": "Який український боксер став абсолютним чемпіоном світу у важкій вазі у 2021 році?",
        "options": ["Олександр Усик", "Віталій Кличко", "Володимир Кличко", "Василь Ломаченко"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська спортсменка здобула золото на Олімпіаді 1996 у спортивній гімнастиці?",
        "options": ["Лілія Подкопаєва", "Яна Клочкова", "Олена Костевич", "Інна Осипенко-Радомська"],
        "correct_option_id": 0
    },
    {        "question": "Який футбольний клуб України вигравав Кубок УЄФА у 2009 році?",
        "options": ["Шахтар Донецьк", "Динамо Київ", "Дніпро", "Металіст Харків"],
        "correct_option_id": 0
    },
    {        "question": "Який український тенісист входив до топ-20 світового рейтингу ATP?",
        "options": ["Олександр Долгополов", "Сергій Стаховський", "Андрій Медведєв", "Всі перелічені"],
        "correct_option_id": 3
    },
    {        "question": "Яка українська біатлоністка виграла золото на Олімпіаді 2014?",
        "options": ["Віта Семеренко", "Олена Підгрушна", "Валентина Семеренко", "Юлія Джима"],
        "correct_option_id": 0
    },
    {        "question": "Який український плавець встановив світовий рекорд на 50 м батерфляєм?",
        "options": ["Андрій Говоров", "Ігор Борисик", "Денис Силантьєв", "Яна Клочкова"],
        "correct_option_id": 0
    },
    {        "question": "Яка українська команда виграла Євробаскет серед жінок у 1995 році?",
        "options": ["Збірна України", "Збірна Росії", "Збірна Литви", "Збірна Франції"],
        "correct_option_id": 0
    },
    {        "question": "Який український шахіст став чемпіоном світу серед жінок у 2012 році?",
        "options": ["Анна Ушеніна", "Марія Музичук", "Катерина Лагно", "Наталія Жукова"],
        "correct_option_id": 0
    },
    {        "question": "Який український боксер має прізвисько 'Хай-Тек'?",
        "options": ["Василь Ломаченко", "Олександр Усик", "Віталій Кличко", "Володимир Кличко"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений вважається одним із засновників теоретичної космонавтики?",
        "options": ["Юрій Кондратюк", "Ігор Сікорський", "Сергій Корольов", "Володимир Вернадський"],
        "correct_option_id": 0
    },
    {        "question": "Хто з українських вчених створив перший у світі гелікоптер?",
        "options": ["Ігор Сікорський", "Юрій Кондратюк", "Сергій Корольов", "Володимир Вернадський"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений відкрив явище фагоцитозу?",
        "options": ["Ілля Мечников", "Володимир Вернадський", "Борис Патон", "Євген Патон"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є засновником біогеохімії?",
        "options": ["Володимир Вернадський", "Ілля Мечников", "Борис Патон", "Євген Патон"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений отримав Нобелівську премію з медицини у 1908 році?",
        "options": ["Ілля Мечников", "Володимир Вернадський", "Борис Патон", "Сергій Корольов"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є автором теорії ноосфери?",
        "options": ["Володимир Вернадський", "Ілля Мечников", "Борис Патон", "Євген Патон"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений створив перший електрозварювальний апарат?",
        "options": ["Євген Патон", "Борис Патон", "Ілля Мечников", "Сергій Корольов"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є засновником електрозварювання під флюсом?",
        "options": ["Борис Патон", "Євген Патон", "Ілля Мечников", "Сергій Корольов"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є одним із творців першого комп’ютера в Європі?",
        "options": ["Віктор Глушков", "Сергій Лебедєв", "Євген Патон", "Ілля Мечников"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений створив першу у світі електронну обчислювальну машину?",
        "options": ["Сергій Лебедєв", "Віктор Глушков", "Євген Патон", "Ілля Мечников"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є засновником теорії міцності матеріалів?",
        "options": ["Степан Тимошенко", "Євген Патон", "Ілля Мечников", "Сергій Корольов"],
        "correct_option_id": 0
    },
    # Природні об'єкти та рекорди
    {        "question": "Яке озеро є найбільшим в Україні за площею?",
        "options": ["Ялпуг", "Світязь", "Синевир", "Кугурлуй"],
        "correct_option_id": 0
    },
    {        "question": "Який водоспад є найвищим в Україні?",
        "options": ["Учан-Су", "Шипіт", "Манявський", "Дземброня"],
        "correct_option_id": 0
    },
    {        "question": "Яка річка є найдовшою в Україні?",
        "options": ["Дніпро", "Дністер", "Південний Буг", "Сіверський Донець"],
        "correct_option_id": 0
    },
    {        "question": "Який гірський масив є найвищим в Україні?",
        "options": ["Чорногора", "Свідовець", "Гриняви", "Мармароси"],
        "correct_option_id": 0
    },
    {        "question": "Яка вершина є найвищою точкою України?",
        "options": ["Говерла", "Петрос", "Бребенескул", "Піп Іван"],
        "correct_option_id": 0
    },
    {        "question": "Який острів є найбільшим у Чорному морі біля України?",
        "options": ["Джарилгач", "Зміїний", "Березань", "Тендрівська коса"],
        "correct_option_id": 0
    },
    {        "question": "Який національний парк є найбільшим в Україні?",
        "options": ["Шацький", "Карпатський", "Азово-Сиваський", "Деснянсько-Старогутський"],
        "correct_option_id": 0
    },
    {        "question": "Який заповідник є найстарішим в Україні?",
        "options": ["Асканія-Нова", "Карпатський", "Дунайський", "Чорноморський"],
        "correct_option_id": 0
    },
    {        "question": "Який ліс є найбільшим масивом дубових лісів в Україні?",
        "options": ["Тростянецький", "Білоцерківський", "Сумський", "Кременецький"],
        "correct_option_id": 0
    },
    {        "question": "Який карстовий об'єкт є найдовшою печерою України?",
        "options": ["Оптимістична", "Млинки", "Атлантида", "Кришталева"],
        "correct_option_id": 0
    },

    # Тварини
    {        "question": "Яка тварина є найбільшим ссавцем України?",
        "options": ["Зубр", "Ведмідь", "Лось", "Олень"],
        "correct_option_id": 0
    },
    {        "question": "Який птах є найбільшим в Україні?",
        "options": ["Дрохва", "Лелека", "Лебідь", "Гуска"],
        "correct_option_id": 0
    },
    # Національні парки та заповідники
    {        "question": "Який національний парк розташований у Львівській області?",
        "options": ["Сколівські Бескиди", "Шацький", "Карпатський", "Деснянсько-Старогутський"],
        "correct_option_id": 0
    },
    {        "question": "Який національний парк розташований на Буковині?",
        "options": ["Вижницький", "Карпатський", "Шацький", "Дунайський"],
        "correct_option_id": 0
    },
    {        "question": "Який заповідник розташований у степах Миколаївщини?",
        "options": ["Єланецький степ", "Асканія-Нова", "Чорноморський", "Дунайський"],
        "correct_option_id": 0
    },
    {        "question": "Який національний парк розташований у Тернопільській області?",
        "options": ["Кременецькі гори", "Шацький", "Карпатський", "Деснянсько-Старогутський"],
        "correct_option_id": 0
    },
    {        "question": "Який заповідник розташований на острові Зміїний?",
        "options": ["Зміїний", "Дунайський", "Чорноморський", "Асканія-Нова"],
        "correct_option_id": 0
    },
    {        "question": "Який національний парк розташований на Прикарпатті?",
        "options": ["Гуцульщина", "Карпатський", "Шацький", "Деснянсько-Старогутський"],
        "correct_option_id": 0
    },
    {        "question": "Який заповідник розташований у дельті Дніпра?",
        "options": ["Нижньодніпровський", "Дунайський", "Чорноморський", "Асканія-Нова"],
        "correct_option_id": 0
    },
    {        "question": "Який національний парк розташований у Хмельницькій області?",
        "options": ["Подільські Товтри", "Шацький", "Карпатський", "Деснянсько-Старогутський"],
        "correct_option_id": 0
    },
    {        "question": "Який заповідник розташований у Луганській області?",
        "options": ["Стрільцівський степ", "Асканія-Нова", "Чорноморський", "Дунайський"],
        "correct_option_id": 0
    },
    {        "question": "Який національний парк розташований у Київській області?",
        "options": ["Голосіївський", "Шацький", "Карпатський", "Деснянсько-Старогутський"],
        "correct_option_id": 0
    },

    # Природні явища та унікальні місця
    {        "question": "Який кратер є найстарішим метеоритним кратером України?",
        "options": ["Бовтиський", "Іллінецький", "Київський", "Криворізький"],
        "correct_option_id": 0
    },
     {        "question": "Який український вчений є одним із творців першої у світі ракети на рідкому паливі?",
        "options": ["Юрій Кондратюк", "Сергій Корольов", "Ігор Сікорський", "Володимир Вернадський"],
        "correct_option_id": 1
    },
    {        "question": "Хто з українських вчених відкрив явище фагоцитозу?",
        "options": ["Ілля Мечников", "Володимир Вернадський", "Борис Патон", "Євген Патон"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є засновником біогеохімії?",
        "options": ["Володимир Вернадський", "Ілля Мечников", "Борис Патон", "Євген Патон"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений отримав Нобелівську премію з медицини у 1908 році?",
        "options": ["Ілля Мечников", "Володимир Вернадський", "Борис Патон", "Сергій Корольов"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є автором теорії ноосфери?",
        "options": ["Володимир Вернадський", "Ілля Мечников", "Борис Патон", "Євген Патон"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений створив перший електрозварювальний апарат?",
        "options": ["Євген Патон", "Борис Патон", "Ілля Мечников", "Сергій Корольов"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є засновником електрозварювання під флюсом?",
        "options": ["Борис Патон", "Євген Патон", "Ілля Мечников", "Сергій Корольов"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений створив перший у світі гелікоптер?",
        "options": ["Ігор Сікорський", "Юрій Кондратюк", "Сергій Корольов", "Володимир Вернадський"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений є засновником теорії міжпланетних польотів?",
        "options": ["Юрій Кондратюк", "Ігор Сікорський", "Сергій Корольов", "Володимир Вернадський"],
        "correct_option_id": 0
    },
    {        "question": "Який український вчений створив перший у світі літак з чотирма двигунами?",
        "options": ["Ігор Сікорський", "Юрій Кондратюк", "Сергій Корольов", "Володимир Вернадський"],
        "correct_option_id": 0
    },

    # Внесок у фізику, математику, біологію
    {        "question": "Який український вчений відкрив рентгенівські промені одночасно з В. Рентгеном?",
        "options": ["Іван Пулюй", "Володимир Вернадський", "Борис Патон", "Євген Патон"],
        "correct_option_id": 0
    },
]
